import showPromoText from './timer_show_hidden_text.js'
import mobileNav from './header_bullshirt.js'
import placeStars from './Arrow_Star.js'
import Timer from "./Timer.js";
$(() => {
    let promoText = [
        ["Акция 00:00-06:00 короткий текст", "Акция 00:00-06:00 длинный текст" +
        " текст текст текст текст текст текст текст текст текст текст текст текст" ],
        ["Акция 06:00-12:00 короткий текст", "Акция 06:00-12:00 длинный текст текст" +
        " текст текст текст текст текст текст текст текст текст текст текст текст" ],
        ["Акция 12:00-18:00 короткий текст", "Акция 12:00-18:00 длинный текст текст" +
        " текст текст текст текст текст текст текст текст текст текст текст текст" ],
        ["Акция 18:00-24:00 короткий текст", "Акция 18:00-24:00 длинный текст текст" +
        " текст текст текст текст текст текст текст текст текст текст текст текст" ],
    ]
    mobileNav($('.menu-button'), $('.burger_menu'))
    placeStars();
    let timer = new Timer(promoText);
    timer.start();
    showPromoText(timer.getPromoText());
})